## 5.2 	MultiIndex对象

In [1]:
import pandas as pd
import numpy as np

### 5.2.1 	创建多级索引对象

In [2]:
keys =[('June', 'apples'), ('June', 'oranges'), ('June', 'bananas'),
         ('Robert', 'apples'), ('Robert', 'oranges'), ('Robert', 'bananas'),
         ('Lily', 'apples'), ('Lily', 'oranges'), ('Lily', 'bananas'),
         ('David', 'apples'), ('David', 'oranges'), ('David', 'bananas') ]
keys

[('June', 'apples'),
 ('June', 'oranges'),
 ('June', 'bananas'),
 ('Robert', 'apples'),
 ('Robert', 'oranges'),
 ('Robert', 'bananas'),
 ('Lily', 'apples'),
 ('Lily', 'oranges'),
 ('Lily', 'bananas'),
 ('David', 'apples'),
 ('David', 'oranges'),
 ('David', 'bananas')]

In [6]:
index = pd.MultiIndex.from_tuples(keys, names=['names', 'fruits'])
index

MultiIndex(levels=[['David', 'June', 'Lily', 'Robert'], ['apples', 'bananas', 'oranges']],
           labels=[[1, 1, 1, 3, 3, 3, 2, 2, 2, 0, 0, 0], [0, 2, 1, 0, 2, 1, 0, 2, 1, 0, 2, 1]],
           names=['names', 'fruits'])

In [4]:
data = [3,0,1,
        2,1,2,
        0,2,1,
        1,3,0]

In [11]:
s = pd.Series(data, index=index)

In [12]:
s

names   fruits
June    apples     3
        oranges    0
        bananas    1
Robert  apples     2
        oranges    1
        bananas    2
Lily    apples     0
        oranges    2
        bananas    1
David   apples     1
        oranges    3
        bananas    0
dtype: int64

### 5.2.2 	维度转换

In [13]:
s.unstack()

fruits  apples  bananas  oranges
names
David        1        0        3
June         3        1        0
Lily         0        1        2
Robert       2        2        1

In [14]:
data = {
    'apples': [3, 2, 0, 1], 
    'oranges': [0, 1, 2, 3],
    'bananas': [1, 2, 1, 0]
}
df = pd.DataFrame(data, index=['June','Robert','Lily','David'])
df

        apples  oranges  bananas
June         3        0        1
Robert       2        1        2
Lily         0        2        1
David        1        3        0

In [15]:
df.stack()

June    apples     3
        oranges    0
        bananas    1
Robert  apples     2
        oranges    1
        bananas    2
Lily    apples     0
        oranges    2
        bananas    1
David   apples     1
        oranges    3
        bananas    0
dtype: int64

# 5.2.3 	多级索引数据存值

In [16]:
s[:,'apples']

names
June      3
Robert    2
Lily      0
David     1
dtype: int64

In [20]:
s.loc[:,'apples']

names
June      3
Robert    2
Lily      0
David     1
dtype: int64

In [17]:
s['June','apples']

3

In [21]:
s.loc['June','apples']

3

In [18]:
s['June',:]

fruits
apples     3
oranges    0
bananas    1
dtype: int64

In [19]:
s.loc['June',:]

fruits
apples     3
oranges    0
bananas    1
dtype: int64